
#include <dht.h>     // Απαραίτητη Βιβλιοθήκη χειρισμού του DHT11

#define DHT11_PIN 6  // Το Ψηφιακό Pin 6 θα χρησιμοποιηθεί για διάβασμα δεδομένων

dht DHT;            // Βασικό Αντικείμενο για αποθήκευση Μετρήσεων
float hum;          // Μεταβλητή Υγρασίας
String msg = "";    // Μεταβλητή String για αποθήκευση και εμφάνιση μετρήσεων

void setup(){             // Αρχικοποίηση
    Serial.begin(9600);   // Ενεργοποίηση της Οθόνης για Προβολή Μετρήσεων
}

void loop(){  // Επαναλαμβανόμενος Κώδικας
    int chk = DHT.read11(DHT11_PIN); // Διάβασμα Δεδομένων από το Ψηφιακό Pin 2
    hum = DHT.humidity;              // Αποθήκευση τιμής Υγρασίας στη μεταβλητή hum
    msg = String(hum) + " %";        // Καταχώρηση της μέτρησης στο msg
    Serial.println(msg);             // Εμφάνιση της μέτρησης στην Οθόνη
    delay(2000);                     //Αναμονή για 2sec και επανάληψη των εντολών
}